InformationRegisters/упГрафикиРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упГрафикиРаботыСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШаблоныГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Календари.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Календари</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияГрафикаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПраздники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецГрафика</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидКалендаря</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьВидыКалендарей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблонЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньВключенВГрафик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упГрафикиРаботыСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПроконтролироватьНаложениеПериодовДействияШаблоновГрафиков(ДатаНачала, ДатаОкончания, СписокОбъектов, Отказ) Экспорт
	
	мсвСписокОбъектов = Новый Массив;
	
	Если ТипЗнч(СписокОбъектов) = Тип("СправочникСсылка.упСотрудники") Тогда
		мсвСписокОбъектов.Добавить(СписокОбъектов);
	Иначе
		мсвСписокОбъектов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(СписокОбъектов);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботы.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботы.Период КАК Период,
	|	ГрафикиРаботы.ДатаНачала КАК ДатаНачала,
	|	ГрафикиРаботы.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втГрафики
	|ИЗ
	|	РегистрСведений.упГрафикиРаботыСотрудников КАК ГрафикиРаботы
	|ГДЕ ИСТИНА
	|	И ГрафикиРаботы.Сотрудник В  (&Объекты)
	|	И ГрафикиРаботы.Период <= &ДатаОкончания
	|	И ГрафикиРаботы.Период >= &ДатаНачала
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГрафикиТ.ДатаНачала КАК ДатаНачала1,
	|	втГрафикиТ.ДатаОкончания КАК ДатаОкончания1,
	|	втГрафикиТ1.ДатаНачала КАК ДатаНачала,
	|	втГрафикиТ1.ДатаОкончания КАК ДатаОкончания,
	|	втГрафикиТ1.Сотрудник КАК Сотрудник
	|ИЗ
	|	втГрафики КАК втГрафикиТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафики КАК втГрафикиТ1
	|	ПО ИСТИНА
	|		И втГрафикиТ1.Сотрудник = втГрафикиТ.Сотрудник
	|		И втГрафикиТ1.Период = втГрафикиТ.Период
	|		И (втГрафикиТ1.ДатаНачала > втГрафикиТ.ДатаНачала
	|		 Или втГрафикиТ1.ДатаОкончания > втГрафикиТ.ДатаОкончания)
	|		И втГрафикиТ1.ДатаНачала < втГрафикиТ.ДатаОкончания
	|		И втГрафикиТ1.ДатаОкончания > втГрафикиТ.ДатаНачала
	|";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Объекты", СписокОбъектов);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru = 'Обнаружены пересекающиеся интервалы по %1.(%2:%3-%4:%5) и (%6:%7-%8:%9)'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
							Выборка.Сотрудник, 
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Час(Выборка.ДатаНачала), 2, "0"),
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Минута(Выборка.ДатаНачала), 2, "0"), 
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Час(Выборка.ДатаОкончания), 2, "0"), 
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Минута(Выборка.ДатаОкончания), 2, "0"),
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Час(Выборка.ДатаНачала1), 2, "0"),
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Минута(Выборка.ДатаНачала1), 2, "0"), 
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Час(Выборка.ДатаОкончания1), 2, "0"), 
							СтроковыеФункцииКлиентСервер.ДополнитьСтроку(""+Минута(Выборка.ДатаОкончания1), 2, "0")
							);

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);

		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

// Создает в менеджере временную таблицу ВТРасписанияРаботы с колонками.
// Подробнее см. комментарий к функции РасписанияРаботыНаПериод.
//
Процедура СоздатьВТРасписанияРаботыНаПериод(МенеджерВременныхТаблиц, Сотрудник, ДатаНачала, ДатаОкончания) Экспорт
	
	ТекстЗапроса = 
	"
	|ВЫБРАТЬ
	|		ГрафикиРаботы.Сотрудник КАК Сотрудник,
	|		ГрафикиРаботы.Период КАК ДатаГрафика,
	|		ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, РАЗНОСТЬДАТ(ГрафикиРаботы.Период, ГрафикиРаботы.ДатаНачала, СЕКУНДА)) КАК ВремяНачала,
	|		ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, РАЗНОСТЬДАТ(ГрафикиРаботы.Период, ГрафикиРаботы.ДатаОкончания, СЕКУНДА)) КАК ВремяОкончания,
	|		ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка) КАК ГрафикРаботы
	|	ПОМЕСТИТЬ ВТРасписанияРаботы
	|	ИЗ
	|		РегистрСведений.упГрафикиРаботыСотрудников КАК ГрафикиРаботы
	|	ГДЕ ИСТИНА
	|		И ГрафикиРаботы.Сотрудник = (&Сотрудник)
	|		И ГрафикиРаботы.Период <= &ДатаОкончания
	|		И ГрафикиРаботы.Период >= &ДатаНачала
	|	ИНДЕКСИРОВАТЬ ПО
	|		ГрафикиРаботы.Период
	|";
	
	// Для вычисления номера в цикле произвольной длины для дня, включенного в график, используется следующая формула:
	// Номер дня = Дней от даты отсчета % Длина цикла, где % - операция деления по модулю.
	
	// Операция деления по модулю в свою очередь производится по формуле:
	// Делимое - Цел(Делимое / Делитель) * Делитель, где Цел() - функция выделения целой части.
	
	// Для выделения целой части используется конструкция:
	// если результат округления числа по правилам «1.5 как 2» больше исходного значения, уменьшаем результат на 1.
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ВидФормы = "ФормаСписка" Тогда
		ВызватьИсключение НСтр("ru = 'Содержимое регистра ""Графики работы сотрудников"" 
								|редактируется обработкой ""РМ: Планирование графиков работы"".'");

	КонецЕсли;
		
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
